In [1]:
import pandas as pd
import numpy as np

In [6]:
dane={
    'wiek':[25,30,43,33,70],
    'miasto':['Warszawa','Poznan','Wroclaw','Krakow','Łódź'],
    'zawód':['kasjerka','elektryk','fryzjerka','mechanik','szewc']}


index=pd.Series(['Anna','Jan','Beata','Stefan','Zygmunt'])
osoby=pd.DataFrame(dane)
osoby=osoby.set_index(index)
osoby

         wiek    miasto      zawód
Anna       25  Warszawa   kasjerka
Jan        30    Poznan   elektryk
Beata      43   Wroclaw  fryzjerka
Stefan     33    Krakow   mechanik
Zygmunt    70      Łódź      szewc

In [4]:
osoby['zawód']

Anna        kasjerka
Jan         elektryk
Beata      fryzjerka
Stefan      mechanik
Zygmunt        szewc
Name: zawód, dtype: object

In [5]:
osoby[['wiek','miasto']]

         wiek    miasto
Anna       25  Warszawa
Jan        30    Poznan
Beata      43   Wroclaw
Stefan     33    Krakow
Zygmunt    70      Łódź

In [7]:
osoby.loc['Anna']

wiek            25
miasto    Warszawa
zawód     kasjerka
Name: Anna, dtype: object

In [8]:
osoby.iloc[0]

wiek            25
miasto    Warszawa
zawód     kasjerka
Name: Anna, dtype: object

In [9]:
osoby.loc[['Anna','Jan','Beata','Stefan']]

        wiek    miasto      zawód
Anna      25  Warszawa   kasjerka
Jan       30    Poznan   elektryk
Beata     43   Wroclaw  fryzjerka
Stefan    33    Krakow   mechanik

In [10]:
osoby.iloc[[0,1,2,3]]

        wiek    miasto      zawód
Anna      25  Warszawa   kasjerka
Jan       30    Poznan   elektryk
Beata     43   Wroclaw  fryzjerka
Stefan    33    Krakow   mechanik

In [11]:
osoby.loc["Anna":'Stefan']

        wiek    miasto      zawód
Anna      25  Warszawa   kasjerka
Jan       30    Poznan   elektryk
Beata     43   Wroclaw  fryzjerka
Stefan    33    Krakow   mechanik

In [16]:
osoby.iloc[0:4]

        wiek    miasto      zawód
Anna      25  Warszawa   kasjerka
Jan       30    Poznan   elektryk
Beata     43   Wroclaw  fryzjerka
Stefan    33    Krakow   mechanik

In [12]:
osoby.loc[['Jan','Anna'],['wiek','zawód']]

      wiek     zawód
Jan     30  elektryk
Anna    25  kasjerka

In [15]:
osoby.iloc[[1,0],[0,2]]

      wiek     zawód
Jan     30  elektryk
Anna    25  kasjerka

In [13]:
osoby.loc['Jan':'Zygmunt','wiek':'zawód']

         wiek   miasto      zawód
Jan        30   Poznan   elektryk
Beata      43  Wroclaw  fryzjerka
Stefan     33   Krakow   mechanik
Zygmunt    70     Łódź      szewc

In [14]:
osoby.iloc[1:5,0:3]

         wiek   miasto      zawód
Jan        30   Poznan   elektryk
Beata      43  Wroclaw  fryzjerka
Stefan     33   Krakow   mechanik
Zygmunt    70     Łódź      szewc

In [17]:
osoby.loc['Jan':,'wiek':]

         wiek   miasto      zawód
Jan        30   Poznan   elektryk
Beata      43  Wroclaw  fryzjerka
Stefan     33   Krakow   mechanik
Zygmunt    70     Łódź      szewc

In [18]:
osoby.iloc[1:,0:]

         wiek   miasto      zawód
Jan        30   Poznan   elektryk
Beata      43  Wroclaw  fryzjerka
Stefan     33   Krakow   mechanik
Zygmunt    70     Łódź      szewc

In [19]:
osoby.loc['Jan',['zawód','miasto']]

zawód     elektryk
miasto      Poznan
Name: Jan, dtype: object

In [20]:
osoby.iloc[:4,1]

Anna      Warszawa
Jan         Poznan
Beata      Wroclaw
Stefan      Krakow
Name: miasto, dtype: object